project/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params[:user_id]
            @artworks = Artwork.where(artist_id: params[:user_id])
        else
            @artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "the scream"], ["image_url", "google.com"], ["artist_id", 2], ["created_at", "2023-05-04 18:47:07.804838"], ["updated_at", "2023-05-04 18:47:07.804838"]]
---
    def create
        @artwork = Artwork.create(artworks_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "the yell"], ["image_url", "yahoo.com"], ["artist_id", 4], ["updated_at", "2023-05-04 18:51:29.057100"], ["id", 7]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork
            @artwork.update(artworks_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
    def destroy
        @artwork = Artwork.find(params[:id])
        if @artwork
            @artwork.destroy