project/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 4], ["created_at", "2023-05-04 19:20:37.251127"], ["updated_at", "2023-05-04 19:20:37.251127"]]
---
    def create
        @share = ArtworkShare.create(share_params)