project/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            @comments = Comment.where(author_id: params[:user_id])
        elsif params[:artwork_id]
            @comments = Comment.where(artwork_id: params[:artist_id]) #???
        else
            @comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 4]]