project/app/controllers/users_controller.rb

    def index

        if params[:id]
            @users = User.find(params[:id])
        else
            @users = User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.create(users_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "mike"], ["email", "evilmike@aa.com"], ["created_at", "2023-05-03 23:27:14.528931"], ["updated_at", "2023-05-03 23:27:14.528931"]]

    def update
        @user = User.find(params[:id])
        if @user.update(users_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "good_guy"], ["updated_at", "2023-05-04 18:12:10.071292"], ["id", 4]]